[
  {
    "name": "ChronoMaster Classic",
    "brand": "TickTock",
    "price": 299,
    "description": "The ChronoMaster Classic from TickTock combines elegance with everyday functionality. Featuring quartz movement for precise timekeeping, a stainless steel case for durability, and a genuine leather strap for comfort, it is versatile for formal or casual wear. Water resistant up to 50 meters, it suits daily activities and brief water exposure. With a sleek, timeless design and refined craftsmanship, this watch offers style, reliability, and sophistication for every occasion.",
    "features": ["Quartz Movement", "Stainless Steel Case", "Water Resistant 50m", "Leather Strap"],
    "image": "https://iili.io/K9Wbe9e.jpg",
    "rating": 4.8,
    "category": "Luxury",
    "totalSells": 50
  },
  {
    "name": "Aurora Minimalist",
    "brand": "TickTock",
    "price": 199,
    "description": "The Aurora Minimalist embodies modern refinement and simplicity. Its slim profile with quartz movement ensures precision, while sapphire crystal glass offers excellent scratch resistance. A sleek leather strap enhances comfort and elegance. With water resistance up to 30 meters, it handles daily splashes with ease. The uncluttered dial ensures clarity, making this versatile watch suitable for casual, professional, and formal wear. A perfect choice for understated elegance with enduring quality.",
    "features": ["Quartz Movement", "Sapphire Crystal", "Water Resistant 30m", "Slim Leather Strap"],
    "image": "https://iili.io/K9Wbwc7.jpg",
    "rating": 4.6,
    "category": "Modern",
    "totalSells": 41
  },
  {
    "name": "Titanium Sport",
    "brand": "TickTock",
    "price": 349,
    "description": "The Titanium Sport by TickTock is built for active lifestyles, blending durability and modern aesthetics. Featuring a lightweight titanium case, it resists corrosion while ensuring comfort. Its chronograph function provides precise timing, while luminous markers enhance readability in low light. Water resistant up to 100 meters, it suits swimming and outdoor adventures. With a rugged rubber strap, this watch offers strength, flexibility, and style for sports enthusiasts and professionals alike.",
    "features": ["Chronograph", "Titanium Case", "Water Resistant 100m", "Rubber Strap"],
    "image": "https://iili.io/K9Wb6KB.jpg",
    "rating": 4.7,
    "category": "Sports",
    "totalSells": 53
  },
  {
    "name": "Elegance Rose Gold",
    "brand": "TickTock",
    "price": 399,
    "description": "The Elegance Rose Gold from TickTock radiates sophistication and charm. Its rose gold-plated finish offers timeless appeal, paired with quartz movement for accuracy. Sapphire crystal glass provides superior scratch resistance, while the genuine leather strap ensures comfort and style. With water resistance up to 50 meters, it balances durability and elegance. Perfect for formal or daily wear, this refined timepiece embodies TickTock’s craftsmanship and makes a thoughtful gift or personal treasure.",
    "features": ["Quartz Movement", "Rose Gold Plated", "Water Resistant 50m", "Leather Strap"],
    "image": "https://iili.io/K9WbgMQ.jpg",
    "rating": 4.9,
    "category": "Luxury",
    "totalSells": 44
  },
  {
    "name": "Vintage Heritage",
    "brand": "TickTock",
    "price": 279,
    "description": "The Vintage Heritage from TickTock revives traditional watchmaking charm with mechanical movement for enthusiasts who value craftsmanship. Its stainless steel case offers durability and refinement, while the genuine leather strap enhances comfort and classic appeal. Water resistant up to 30 meters, it suits daily wear. The clean dial design emphasizes readability and timeless aesthetics, making this watch an elegant accessory for collectors, professionals, and those who appreciate enduring horological artistry.",
    "features": ["Mechanical Movement", "Stainless Steel Case", "Water Resistant 30m", "Leather Strap"],
    "image": "https://iili.io/K9WbZNa.jpg",
    "rating": 4.5,
    "category": "Vintage",
    "totalSells": 62
  },
  {
    "name": "ChronoMaster Classic",
    "brand": "TickTock",
    "price": 299,
    "description": "The ChronoMaster Classic combines elegance with functionality for any occasion. Featuring precise quartz movement, a stainless steel case, and a genuine leather strap, it delivers comfort and durability. Water resistant up to 50 meters, it handles everyday splashes with ease. Its sleek, timeless design offers refined craftsmanship and clear readability, making it a versatile accessory that enhances business, casual, or formal looks while reflecting TickTock’s signature style and precision.",
    "features": ["Quartz Movement", "Stainless Steel Case", "Water Resistant 50m", "Leather Strap"],
    "image": "https://iili.io/K9Wbe9e.jpg",
    "rating": 4.8,
    "category": "Luxury",
    "totalSells": 50
  },
  {
    "name": "Aurora Minimalist",
    "brand": "TickTock",
    "price": 199,
    "description": "The Aurora Minimalist embodies simplicity and modern refinement. Powered by quartz movement, it ensures precise timekeeping, while sapphire crystal glass resists scratches and enhances durability. Its slim leather strap adds sophistication and comfort. Water resistant up to 30 meters, it withstands daily splashes with ease. Featuring an uncluttered dial for clarity, this versatile design pairs seamlessly with casual, business, or formal wear, reflecting TickTock’s dedication to craftsmanship and elegance.",
    "features": ["Quartz Movement", "Sapphire Crystal", "Water Resistant 30m", "Slim Leather Strap"],
    "image": "https://iili.io/K9Wbwc7.jpg",
    "rating": 4.6,
    "category": "Modern",
    "totalSells": 41
  },
  {
    "name": "Titanium Sport",
    "brand": "TickTock",
    "price": 349,
    "description": "The Titanium Sport is built for performance and style. Its lightweight titanium case offers durability and comfort, while a chronograph function ensures precise timing. Luminous hands and markers improve visibility in low light. Water resistant up to 100 meters, it’s ideal for swimming and active lifestyles. Completed with a rugged rubber strap, this watch delivers strength, reliability, and modern appeal, making it perfect for sports enthusiasts and professionals alike.",
    "features": ["Chronograph", "Titanium Case", "Water Resistant 100m", "Rubber Strap"],
    "image": "https://iili.io/K9Wb6KB.jpg",
    "rating": 4.7,
    "category": "Sports",
    "totalSells": 53
  },
  {
    "name": "Elegance Rose Gold",
    "brand": "TickTock",
    "price": 399,
    "description": "The Elegance Rose Gold reflects sophistication and premium craftsmanship. Its rose gold-plated finish radiates charm, while quartz movement ensures precise accuracy. Sapphire crystal glass offers superior scratch resistance, and the leather strap provides comfort and refinement. Water resistant up to 50 meters, it blends durability with elegance. Perfect for professional or formal wear, this watch embodies TickTock’s quality design, making it a luxurious timepiece for personal use or gifting.",
    "features": ["Quartz Movement", "Rose Gold Plated", "Water Resistant 50m", "Leather Strap"],
    "image": "https://iili.io/K9WbgMQ.jpg",
    "rating": 4.9,
    "category": "Luxury",
    "totalSells": 44
  },
  {
    "name": "Vintage Heritage",
    "brand": "TickTock",
    "price": 279,
    "description": "The Vintage Heritage revives classic watchmaking with its mechanical movement, appealing to enthusiasts of traditional craftsmanship. Featuring a stainless steel case and a genuine leather strap, it balances durability with sophistication. Water resistant up to 30 meters, it withstands daily use. Its clean, vintage-inspired dial ensures readability and timeless style. A perfect choice for collectors and professionals, this watch reflects TickTock’s dedication to heritage-inspired elegance and reliable artistry.",
    "features": ["Mechanical Movement", "Stainless Steel Case", "Water Resistant 30m", "Leather Strap"],
    "image": "https://iili.io/K9WbZNa.jpg",
    "rating": 4.5,
    "category": "Vintage",
    "totalSells": 62
  },
  {
    "name": "Modern Chronograph",
    "brand": "TickTock",
    "price": 319,
    "description": "The Modern Chronograph blends style with multifunction performance. Featuring quartz movement and chronograph sub-dials, it delivers precision for everyday use. Sapphire glass ensures scratch resistance, while a robust metal bracelet combines comfort with durability. Water resistant up to 50 meters, it suits daily activities. Its refined dial design merges modern aesthetics with clarity, making it an excellent accessory for professional, casual, or formal wear with dependable TickTock craftsmanship.",
    "features": ["Chronograph", "Quartz Movement", "Sapphire Glass", "Metal Bracelet"],
    "image": "https://iili.io/K9Wbbov.jpg",
    "rating": 4.7,
    "category": "Modern",
    "totalSells": 47
  },
  {
    "name": "Ocean Diver",
    "brand": "TickTock",
    "price": 429,
    "description": "The Ocean Diver is a professional-grade timepiece crafted for underwater adventures. Featuring automatic movement and a rotating bezel, it ensures precision and reliability. Water resistant up to 200 meters, it withstands demanding diving conditions. Luminous markers enhance readability, while a rubber strap adds comfort and durability. Its modern design complements both sporty and casual outfits, making it a versatile choice for explorers who value performance, style, and TickTock quality.",
    "features": ["Automatic Movement", "200m Water Resistant", "Rotating Bezel", "Rubber Strap"],
    "image": "https://iili.io/K9WbmVR.jpg",
    "rating": 4.8,
    "category": "Sports",
    "totalSells": 38
  },
  {
    "name": "City Explorer",
    "brand": "TickTock",
    "price": 239,
    "description": "The City Explorer is a sleek urban watch designed for modern professionals. Its quartz movement provides accurate timekeeping, while the metal mesh strap adds durability and style. Water resistant up to 30 meters, it resists everyday splashes. Featuring a minimalist dial for clarity, it blends seamlessly with casual or formal outfits. Comfortable and versatile, the City Explorer reflects TickTock’s attention to detail, making it a perfect companion for city life.",
    "features": ["Quartz Movement", "Metal Mesh Strap", "Water Resistant 30m", "Minimalist Design"],
    "image": "https://iili.io/K9WbpPp.jpg",
    "rating": 4.6,
    "category": "Modern",
    "totalSells": 36
  },
  {
    "name": "Midnight Black",
    "brand": "TickTock",
    "price": 289,
    "description": "The Midnight Black offers understated sophistication with quartz precision. Its black stainless steel case combines durability and style, while a leather strap ensures comfort. Luminous hands improve readability in low light. Water resistant up to 50 meters, it suits daily use. The minimalist dial enhances elegance, making this watch versatile for casual, business, or formal occasions. With durability and craftsmanship, the Midnight Black reflects TickTock’s dedication to timeless design.",
    "features": ["Quartz Movement", "Black Stainless Steel", "Water Resistant 50m", "Leather Strap"],
    "image": "https://iili.io/K9Wm3Rn.jpg",
    "rating": 4.7,
    "category": "Luxury",
    "totalSells": 60
  },
  {
    "name": "Silver Horizon",
    "brand": "TickTock",
    "price": 309,
    "description": "The Silver Horizon blends refinement and durability with quartz movement and sapphire glass for scratch resistance. Its sleek dial and polished metal bracelet enhance sophistication. Water resistant up to 50 meters, it withstands daily splashes and minor immersion. Ideal for professionals and fashion-conscious wearers, this watch balances precision and style. With TickTock’s craftsmanship, the Silver Horizon offers timeless design and reliable performance, making it a versatile companion for any occasion.",
    "features": ["Quartz Movement", "Sapphire Glass", "Water Resistant 50m", "Metal Bracelet"],
    "image": "https://iili.io/K9WmCil.jpg",
    "rating": 4.8,
    "category": "Luxury",
    "totalSells": 42
  },
  {
    "name": "Classic Leather",
    "brand": "TickTock",
    "price": 199,
    "description": "The Classic Leather reflects simplicity and elegance with quartz precision and a genuine leather strap. Its minimalist dial ensures clarity, while water resistance up to 30 meters protects against minor splashes. Combining durability with sophistication, it adapts effortlessly to casual and formal attire. A versatile accessory for everyday wear, the Classic Leather embodies TickTock’s craftsmanship, making it a thoughtful gift or timeless addition to any modern watch collection.",
    "features": ["Quartz Movement", "Leather Strap", "Water Resistant 30m", "Classic Design"],
    "image": "https://iili.io/K9Wmof2.jpg",
    "rating": 4.5,
    "category": "Vintage",
    "totalSells": 33
  },
  {
    "name": "Blue Sapphire",
    "brand": "TickTock",
    "price": 369,
    "description": "The Blue Sapphire combines modern elegance with enduring quality. Its quartz movement ensures accuracy, while sapphire glass enhances scratch resistance and clarity. Featuring a polished metal case and bracelet, it balances durability with refinement. Water resistant up to 50 meters, it handles daily splashes with ease. With a sleek dial and stylish design, the Blue Sapphire suits casual, formal, and professional wear, reflecting TickTock’s craftsmanship and timeless sophistication.",
    "features": ["Quartz Movement", "Sapphire Glass", "Water Resistant 50m", "Metal Bracelet"],
    "image": "https://iili.io/K9WmxlS.jpg",
    "rating": 4.9,
    "category": "Modern",
    "totalSells": 55
  },
  {
    "name": "Golden Era",
    "brand": "TickTock",
    "price": 449,
    "description": "The Golden Era is a luxury gold-plated timepiece blending traditional craftsmanship with modern appeal. Featuring mechanical movement, it delivers precise accuracy, while a premium leather strap enhances refinement and comfort. Water resistant up to 50 meters, it balances durability and elegance. Every detail, from its polished case to its classic dial, reflects TickTock’s dedication to quality. A timeless accessory, perfect for formal settings or as a distinguished personal gift.",
    "features": ["Mechanical Movement", "Gold Plated", "Water Resistant 50m", "Leather Strap"],
    "image": "https://iili.io/K9Wm1UP.jpg",
    "rating": 4.9,
    "category": "Luxury",
    "totalSells": 48
  },
  {
    "name": "Sport Racer",
    "brand": "TickTock",
    "price": 279,
    "description": "The Sport Racer is inspired by racing, designed for bold style and functionality. Its chronograph ensures accurate timing, while quartz movement delivers precision. The durable rubber strap provides comfort during active wear. Water resistant up to 100 meters, it withstands swimming and daily use. With striking aesthetics and sporty appeal, this watch reflects TickTock’s craftsmanship, making it ideal for enthusiasts who value reliability, performance, and standout design in one package.",
    "features": ["Chronograph", "Quartz Movement", "Water Resistant 100m", "Rubber Strap"],
    "image": "https://iili.io/K9WmlfV.jpg",
    "rating": 4.6,
    "category": "Sports",
    "totalSells": 40
  },
  {
    "name": "Timeless Minimal",
    "brand": "TickTock",
    "price": 219,
    "description": "The Timeless Minimal delivers elegance with everyday sophistication. Featuring quartz precision and a comfortable leather strap, it blends reliability with modern style. Its uncluttered dial ensures clarity, while water resistance up to 30 meters protects from daily splashes. Suitable for professional, casual, or formal outfits, this watch offers versatility and durability. Reflecting TickTock’s craftsmanship, the Timeless Minimal is ideal for those who appreciate simplicity, refinement, and lasting quality in accessories.",
    "features": ["Quartz Movement", "Leather Strap", "Water Resistant 30m", "Minimal Design"],
    "image": "https://iili.io/K9WmjWv.jpg",
    "rating": 4.7,
    "category": "Modern",
    "totalSells": 52
  },
  {
    "name": "Classic Chrono",
    "brand": "TickTock",
    "price": 329,
    "description": "The Classic Chrono merges timeless elegance with chronograph functionality. Powered by quartz movement, it ensures precise timekeeping, while sub-dials measure elapsed time with accuracy. Its metal bracelet offers strength and style, complementing the sleek dial design. Water resistant up to 50 meters, it suits everyday use. Reflecting TickTock’s dedication to premium materials and detail, the Classic Chrono enhances professional, formal, or casual wear with sophistication, versatility, and dependable performance.",
    "features": ["Chronograph", "Quartz Movement", "Water Resistant 50m", "Metal Bracelet"],
    "image": "https://iili.io/K9WmhzJ.jpg",
    "rating": 4.8,
    "category": "Luxury",
    "totalSells": 39
  },
  {
    "name": "Rosewood Elegance",
    "brand": "TickTock",
    "price": 389,
    "description": "The Rosewood Elegance blends natural sophistication with modern craftsmanship. Featuring a rosewood case and sapphire glass, it offers durability and elegance. Powered by quartz movement, it delivers accurate timekeeping, while a genuine leather strap ensures comfort and style. Water resistant up to 50 meters, it withstands daily splashes. With a refined dial and premium details, this luxurious watch reflects TickTock’s artistry, making it ideal for collectors, professionals, or stylish individuals.",
    "features": ["Quartz Movement", "Rosewood Case", "Sapphire Glass", "Leather Strap"],
    "image": "https://iili.io/K9Wm6Xf.jpg",
    "rating": 4.9,
    "category": "Luxury",
    "totalSells": 45
  },
  {
    "name": "Urban Classic",
    "brand": "TickTock",
    "price": 249,
    "description": "The Urban Classic is designed for modern city lifestyles. Featuring quartz precision and a stainless steel mesh strap, it combines comfort with durability. Water resistant up to 30 meters, it withstands minor splashes. Its minimal dial emphasizes clarity and style, blending easily with professional, casual, or formal outfits. Reflecting TickTock’s craftsmanship, the Urban Classic is a versatile accessory that complements various occasions, offering understated elegance, practicality, and timeless design.",
    "features": ["Quartz Movement", "Metal Mesh Strap", "Water Resistant 30m", "Minimal Design"],
    "image": "https://iili.io/K9Wmsql.jpg",
    "rating": 4.6,
    "category": "Modern",
    "totalSells": 37
  },
  {
    "name": "Adventure Pro",
    "brand": "TickTock",
    "price": 419,
    "description": "The Adventure Pro is crafted for explorers and outdoor enthusiasts. Its quartz movement ensures precision, while a rugged case and compass dial provide functionality. A rubber strap enhances resilience and comfort in demanding conditions. Water resistant up to 100 meters, it withstands swimming and outdoor activities. With bold design and reliable features, the Adventure Pro reflects TickTock’s craftsmanship, making it an ideal companion for adventurous lifestyles and modern exploration.",
    "features": ["Quartz Movement", "Durable Case", "Water Resistant 100m", "Rubber Strap"],
    "image": "https://iili.io/K9Wmtd7.jpg",
    "rating": 4.8,
    "category": "Sports",
    "totalSells": 46
  },
  {
    "name": "Golden Minimalist",
    "brand": "TickTock",
    "price": 359,
    "description": "The Golden Minimalist combines understated luxury with modern style. Featuring quartz movement, it offers precise accuracy, while subtle gold accents add sophistication. Its leather strap ensures comfort and durability. Water resistant up to 50 meters, it provides daily practicality. With a minimalist dial emphasizing clarity and elegance, this watch balances refinement and versatility. Reflecting TickTock’s craftsmanship, the Golden Minimalist is ideal for those seeking reliable performance and timeless luxury.",
    "features": ["Quartz Movement", "Gold Accents", "Water Resistant 50m", "Leather Strap"],
    "image": "https://iili.io/K9Wmmmu.jpg",
    "rating": 4.9,
    "category": "Luxury",
    "totalSells": 43
  }
]
